espressif/esp-idf/components/soc/esp32s31/register/soc/ledc_reg.h
/** LEDC_TIMER_POWER_UP_CONF_REG register
 *  LEDC timer power up configuration register
 */
#define LEDC_TIMER_POWER_UP_CONF_REG (DR_REG_LEDC_BASE + 0x178)
/** LEDC_TIMER0_POWER_UP : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to power up timer0.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER0_POWER_UP    (BIT(0))
#define LEDC_TIMER0_POWER_UP_M  (LEDC_TIMER0_POWER_UP_V << LEDC_TIMER0_POWER_UP_S)
#define LEDC_TIMER0_POWER_UP_V  0x00000001U
#define LEDC_TIMER0_POWER_UP_S  0
/** LEDC_TIMER1_POWER_UP : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to power up timer1.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER1_POWER_UP    (BIT(1))
#define LEDC_TIMER1_POWER_UP_M  (LEDC_TIMER1_POWER_UP_V << LEDC_TIMER1_POWER_UP_S)
#define LEDC_TIMER1_POWER_UP_V  0x00000001U
#define LEDC_TIMER1_POWER_UP_S  1
/** LEDC_TIMER2_POWER_UP : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to power up timer2.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER2_POWER_UP    (BIT(2))
#define LEDC_TIMER2_POWER_UP_M  (LEDC_TIMER2_POWER_UP_V << LEDC_TIMER2_POWER_UP_S)
#define LEDC_TIMER2_POWER_UP_V  0x00000001U
#define LEDC_TIMER2_POWER_UP_S  2
/** LEDC_TIMER3_POWER_UP : R/W; bitpos: [3]; default: 0;
 *  Configures whether or not to power up timer3.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER3_POWER_UP    (BIT(3))
#define LEDC_TIMER3_POWER_UP_M  (LEDC_TIMER3_POWER_UP_V << LEDC_TIMER3_POWER_UP_S)
#define LEDC_TIMER3_POWER_UP_V  0x00000001U
#define LEDC_TIMER3_POWER_UP_S  3
/** LEDC_TIMER0_CLK_GATE_FORCE_ON : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to open timer0 clock gate.
 *  0: Open the clock gate only when timer0 is power up
 *  1: Force open the clock gate for timer0
 */
#define LEDC_TIMER0_CLK_GATE_FORCE_ON    (BIT(4))
#define LEDC_TIMER0_CLK_GATE_FORCE_ON_M  (LEDC_TIMER0_CLK_GATE_FORCE_ON_V << LEDC_TIMER0_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER0_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER0_CLK_GATE_FORCE_ON_S  4
/** LEDC_TIMER1_CLK_GATE_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to open timer1 clock gate.
 *  0: Open the clock gate only when timer1 is power up
 *  1: Force open the clock gate for timer1
 */
#define LEDC_TIMER1_CLK_GATE_FORCE_ON    (BIT(5))
#define LEDC_TIMER1_CLK_GATE_FORCE_ON_M  (LEDC_TIMER1_CLK_GATE_FORCE_ON_V << LEDC_TIMER1_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER1_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER1_CLK_GATE_FORCE_ON_S  5
/** LEDC_TIMER2_CLK_GATE_FORCE_ON : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to open timer2 clock gate.
 *  0: Open the clock gate only when timer2 is power up
 *  1: Force open the clock gate for timer2
 */
#define LEDC_TIMER2_CLK_GATE_FORCE_ON    (BIT(6))
#define LEDC_TIMER2_CLK_GATE_FORCE_ON_M  (LEDC_TIMER2_CLK_GATE_FORCE_ON_V << LEDC_TIMER2_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER2_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER2_CLK_GATE_FORCE_ON_S  6
/** LEDC_TIMER3_CLK_GATE_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to open timer3 clock gate.
 *  0: Open the clock gate only when timer3 is power up
 *  1: Force open the clock gate for timer3
 */
#define LEDC_TIMER3_CLK_GATE_FORCE_ON    (BIT(7))
#define LEDC_TIMER3_CLK_GATE_FORCE_ON_M  (LEDC_TIMER3_CLK_GATE_FORCE_ON_V << LEDC_TIMER3_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER3_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER3_CLK_GATE_FORCE_ON_S  7

/** LEDC_DATE_REG register
 *  Version control register
 */
#define LEDC_DATE_REG (DR_REG_LEDC_BASE + 0x17c)
/** LEDC_LEDC_DATE : R/W; bitpos: [27:0]; default: 38801744;
 *  Configures the version.
 */
#define LEDC_LEDC_DATE    0x0FFFFFFFU
#define LEDC_LEDC_DATE_M  (LEDC_LEDC_DATE_V << LEDC_LEDC_DATE_S)
#define LEDC_LEDC_DATE_V  0x0FFFFFFFU
#define LEDC_LEDC_DATE_S  0

#ifdef __cplusplus
}
#endif
